# Логистическая регрессия

В этом задании необходимо дописать класс LogisticRegression и применить его для задачи прогназирования погибших людей на титанике. Для сдачи задания придётся зарегистрироваться в платформе https://www.kaggle.com/ . В найдёте соревнование https://www.kaggle.com/c/titanic, в котором нужно будет принять участие. Для сдачи этого задания нужно указать свой никнейм, для проверки позиции на доске участников и прислать выполненный ноутбук.

### Нужно загрузить данные из файла titanic.csv с помощью библиотеки pandas. И вывести результат

Используйте функцию `read_csv` и параметр `index_col` для столбца с именем `PassengerId`, чтобы этот столбец превратился в индекс. 

Воспользутей функцией `head`, чтобы вывести DataFrame как таблицу

In [ ]:
import pandas as pd

dataset = pd.read_csv("titanic.csv", index_col='PassengerId')
dataset.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

### Извлеките только столбцы с именами 'Fare', 'Pclass', 'Age', 'Sex', 'Survived'

`dataset[['Collumn_name']]` синтаксис, преобразуйте категориальный признак `Sex` в числа, 0 и 1.

In [4]:
dataset = dataset[['Fare', 'Pclass', 'Age', 'Sex', 'Survived']]
dataset.loc[dataset['Sex'] == 'male', 'Sex'] = 0.
dataset.loc[dataset['Sex'] == 'female', 'Sex'] = 1.
dataset.head()

                Fare  Pclass   Age Sex  Survived
PassengerId
1             7.2500       3  22.0   0         0
2            71.2833       1  38.0   1         1
3             7.9250       3  26.0   1         1
4            53.1000       1  35.0   1         1
5             8.0500       3  35.0   0         0

### Избавьтесь от пропусков 

Посмотрите на данные, обратите внимание на значения `NaN` в поле `Age`. Для обучающей выборки можно отбросить данные с пропусками функцией `dropna`, но лучше подставить некоторое значение. Для этого задания замените все пропуски с помощью среднего по столбцу возраст. Воспользуйтесь функцией `fillna` и передайте туда среднее

In [6]:
mean_age = dataset['Age'].mean()

dataset['Age'] = dataset[['Age']].fillna(value=mean_age)

dataset.head(10)

                Fare  Pclass        Age Sex  Survived
PassengerId
1             7.2500       3  22.000000   0         0
2            71.2833       1  38.000000   1         1
3             7.9250       3  26.000000   1         1
4            53.1000       1  35.000000   1         1
5             8.0500       3  35.000000   0         0
6             8.4583       3  29.699118   0         0
7            51.8625       1  54.000000   0         0
8            21.0750       3   2.000000   0         0
9            11.1333       3  27.000000   1         1
10           30.0708       2  14.000000   1         1

### Разбейте датасет на признаки X и метки y. Преобразуйте их в numpy массивы

In [11]:
import numpy as np
X = np.array( dataset[['Fare', 'Pclass', 'Age', 'Sex']] ).astype(np.float64)
y = np.array( dataset[['Survived']] )[:,0].astype(np.float64)

<class 'float'>
(891, 4)
(891,)

### Обучите логистическую регрессию

Убедитесь что вы завершили работу в файле ```linear_model.py```.

In [13]:
from linear_model import LogisticRegression

In [14]:
clf = LogisticRegression(epsilon=0.000001)

In [15]:
clf.fit(X,y, verbose=False)

AttributeError: 'float' object has no attribute 'exp'

### Посмотрите значение целевой функции

In [11]:
clf.cost(X, y)

0.51567329458777333

### Предсказание на тестовых данных

Чтобы завершить задание скачайте тестовую выборку с kaggle. И загрузите датасет

In [82]:
testset = pd.read_csv("test.csv", index_col='PassengerId')
testset.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Ticket</th>
      <th>Fare</th>
      <th>Cabin</th>
      <th>Embarked</th>
    </tr>
    <tr>
      <th>PassengerId</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>892</th>
      <td>3</td>
      <td>Kelly, Mr. James</td>
      <td>male</td>
      <td>34.5</td>
      <td>0</td>
      <td>0</td>
      <td>330911</td>
      <td>7.8292</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>893</th>
      <td>3</td>
      <td>Wilkes, Mrs. James (Ellen Needs)</td>
      <td>female</td>
      <td>47.0</td>
      <td>1</td>
      <td>0</td>
      <td>363272</td>
      <td>7.0000</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>894</th>
      <td>2</td>
      <td>Myles, Mr. Thomas Francis</td>
      <td>male</td>
      <td>62.0</td>
      <td>0</td>
      <td>0</td>
      <td>240276</td>
      <td>9.6875</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>895</th>
      <td>3</td>
      <td>Wirz, Mr. Albert</td>
      <td>male</td>
      <td>27.0</td>
      <td>0</td>
      <td>0</td>
      <td>315154</td>
      <td>8.6625</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>896</th>
      <td>3</td>
      <td>Hirvonen, Mrs. Alexander (Helga E Lindqvist)</td>
      <td>female</td>
      <td>22.0</td>
      <td>1</td>
      <td>1</td>
      <td>3101298</td>
      <td>12.2875</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
  </tbody>
</table>
</div>

### Проделайте такие же преобразования

- возьмите только столбцы ['Fare', 'Pclass', 'Age', 'Sex']
- замените текстовое представление пола на числовое 
- замените пропуски в возрасте средним значением по столбцу Age

In [83]:
testset = testset[['Fare', 'Pclass', 'Age', 'Sex']]
testset.loc[testset['Sex'] == 'male', 'Sex'] = 0
testset.loc[testset['Sex'] == 'female', 'Sex'] = 1
mean_age_test = testset['Age'].mean()
testset['Age'] = testset[['Age']].fillna(value=mean_age_test)

# В датасете есть ещё пропуск в одном месте, заполним его просто нулём
testset = testset.fillna(0)
testset.head(5)

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Fare</th>
      <th>Pclass</th>
      <th>Age</th>
      <th>Sex</th>
    </tr>
    <tr>
      <th>PassengerId</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>892</th>
      <td>7.8292</td>
      <td>3</td>
      <td>34.5</td>
      <td>0</td>
    </tr>
    <tr>
      <th>893</th>
      <td>7.0000</td>
      <td>3</td>
      <td>47.0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>894</th>
      <td>9.6875</td>
      <td>2</td>
      <td>62.0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>895</th>
      <td>8.6625</td>
      <td>3</td>
      <td>27.0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>896</th>
      <td>12.2875</td>
      <td>3</td>
      <td>22.0</td>
      <td>1</td>
    </tr>
  </tbody>
</table>
</div>

In [84]:
# Преобразуем DataFrame в массив 
X_test =np.array( testset[['Fare', 'Pclass', 'Age', 'Sex']] ).astype(np.float64)

In [85]:
# Получим результат в виде вероятностей
result = clf.predict(X_test)

In [86]:
# заменим вероятности метками классов 
result[[result>0.5]]=1
result[[result<0.5]]=0

### Сформируйте результат в заданном формате и отправьте результат в kaggle

Ожидаемый результат около 74% точности

In [22]:
testset.insert(0,"Survived",result)
testset['Survived'] = testset['Survived'].astype(int)
testset[['Survived']].to_csv('submition.csv')

### Отправьте выполненное задание на проверку, с указанием имени пользователя, для проверки в kaggle